#define F_CPU 16000000UL // частота - 16MHz

#include <avr/io.h> // Бібліотека вводу/виводу

int main(void) {
    DDRB |= (1 << DDB5);            // PB5=OC1A=D11 як ВИХІД
    DDRB |= (1 << DDB6);            // PB6=OC1B=D12 як ВИХІД

    TCCR1B |= (1 << WGM13) | (1 << WGM12);    // встановлюємо режим
    //TCCR1A &=
    TCCR1B |= (1 << CS10) | (1 << CS12);    // дільник 1024

    TCCR1A |= (1 << COM1A0) | (1 << COM1B0);    // інверсія при збігу

    ICR1 = 700;                // максимум ICR1

    OCR1A = 500;                // значення OCR1A для порівняння
    OCR1B = 200;            // значення OCR1B для порівняння

    while (1) {}; //основна програма
}