#define F_CPU 16000000UL // частота - 16MHz

#include <avr/io.h> // Бібліотека вводу/виводу

int main(void) {
    DDRB |= (1 << DDB4);            // PB4=OC2A=D10 як ВИХІД
    DDRH |= (1 << DDH6);            // PH6=OC2B=D9 як ВИХІД

    TCCR2A |= (1 << WGM20);        // встановлюємо режим
    TCCR2B |= (1 << CS20) | (1 << CS21);    // дільник 32

    TCCR2A |= (1 << COM2A0) | (1 << COM2A1);    // режим інвертованого ШІМ-сигналу
    TCCR2A |= (1 << COM2B1);        // режим неінвертованого ШІМ-сигналу

    OCR2A = 155;                // максимум OCR2A
    OCR2B = 188;            // максимум OCR2B

    while (1) {}; //основна програма
}