#define F_CPU 16000000UL // частота - 16MHz

#include <avr/io.h> // Бібліотека вводу/виводу

int main(void) {
    DDRB |= (1 << DDB1);            // PB1=OC1A=DB1 як ВИХІД
    DDRB |= (1 << DDB2);            // PB2=OC1B=DB2 як ВИХІД

    TCCR1A |= (1 << WGM11);        // встановлюємо режим 2
    TCCR1B |= (1 << CS11);        // дільник 8

    TCCR1A |= (1 << COM1A0) | (1 << COM1A1);    // режим інвертованого ШІМ-сигналу
    TCCR1A |= (1 << COM1B1);        // режим неінвертованого ШІМ-сигналу

    OCR1A = 374;                // максимум OCR2A
    OCR1B = 61;            // максимум OCR2B

    while (1) {}; //основна програма
}
